/**
 * 匹配11位手机号码
 * ^[1] 匹配1开头
 * {9} 匹配剩下9位数字
 * $匹配字符串结束位置
 * @param data
 */

function isPhoneAvailable(data) {
    let reg=/^[1][3,4,5,7,8][0-9]{9}$/
}

/**
 * 匹配邮箱地址
 *
 */
function email() {
    let reg=/^[a-zA-Z0-9_-]+@([a-zA-Z0-9+\.])+(com|cn|net|org)$/
}

/**
 * 验证时间格式
 *  \d匹配数字
 */
function time(){
    //是否正确
    let reg=/^(\d{4})-(\d{2})-(\d{2})/

    //是否合法
    let reg2=/^(\d{4})-(?:(?:0[1-9])|(?:1[0-2]))-(?:(?:[0-2][1-9])|(?:[3][0-1]))/

}
let reg2=/^(\d{4})-(?:(?:0[1-9])|(?:1[0-2]))-(?:(?:[0-2][1-9])|(?:[3][0-1]))/
let data='2018-13-05'
console.log(reg2.test(data));
